# Mundo 4
### Introdução ao Pandas

In [1]:
import pandas as pd

In [2]:
df_cambio = pd.DataFrame({
    "moeda": ['dolar/real', 'libra/real'] * 2,
    "price": [5.24, 4.15, 5.26, 4.23],
    "data": sorted(list(pd.date_range("1/5/2014", periods = 2)) * 2)
})

df_cambio

        data       moeda  price
0 2014-01-05  dolar/real   5.24
1 2014-01-05  libra/real   4.15
2 2014-01-06  dolar/real   5.26
3 2014-01-06  libra/real   4.23

In [7]:
#Como trocar o nome das colunas 

df_cambio.columns

df_cambio.columns = ['data', 'moeda', 'cotacao']

df_cambio

        data       moeda  cotacao
0 2014-01-05  dolar/real     5.24
1 2014-01-05  libra/real     4.15
2 2014-01-06  dolar/real     5.26
3 2014-01-06  libra/real     4.23

In [12]:
#como selecionar colunas 

cotacao = df_cambio['cotacao'] #te devolve uma serie
cotacao

0    5.24
1    4.15
2    5.26
3    4.23
Name: cotacao, dtype: float64

In [13]:
#2 colunas
cotacao_e_data = df_cambio[['cotacao', 'data']] #lista dentro da lista

print(cotacao_e_data)

#vantagem da data como indice

df_cambio = df_cambio.set_index("data")

cotacao = df_cambio['cotacao'] 

cotacao

   cotacao       data
0     5.24 2014-01-05
1     4.15 2014-01-05
2     5.26 2014-01-06
3     4.23 2014-01-06

data
2014-01-05    5.24
2014-01-05    4.15
2014-01-06    5.26
2014-01-06    4.23
Name: cotacao, dtype: float64

In [ ]:
#selecionando colunas por condições

cambio_menor_que_5 = df_cambio[df_cambio['cotacao'] < 5]

print(cambio_menor_que_5)

#selecionando o cambio

cambio_dolar = df_cambio[df_cambio['moeda'] == 'dolar/real']

cambio_dolar

In [ ]:
#selecionando duas condições ao mesmo tempo (operadores & e |)

#dolar e maior que 5.25
cambio_dolar_e_maior_que_525 = df_cambio[(df_cambio['moeda'] == 'dolar/real') &
                                                      (df_cambio['cotacao'] > 5.25)]

print(cambio_dolar_e_maior_que_525)

#libra ou maior que 5.25
cambio_libra_ou_maior_que_525 = df_cambio[(df_cambio['moeda'] == 'libra/real') |
                                                      (df_cambio['cotacao'] > 5.25)]

print(cambio_libra_ou_maior_que_525)


#podemos filtrar o indice também

#libra no dia 5 de janeiro de 2014

libra_5_jan = df_cambio[(df_cambio['moeda'] == 'libra/real') &
                        (df_cambio.index == "2014-01-05")]

libra_5_jan

# Exercícios

* Exercício 40: Mude o nome da coluna do dataframe do exercício 39 de "cotacoes" para "precos".
* Exercício 41: Selecione a coluna de preços do dataframe estudado.
* Exercício 42: Selecione as duas últimas colunas do dataframe estudado.
* Exercício 43: Selecione as informações da Petrobras no dataframe estudado.
* Exercício 44: Selecione apenas empresas com P/L menor que 20.
* Exercício 45: Selecione empresas com P/L maior que 10 e volume maior que 2000.
* Exercício 46: Selecione empresas que a cotação seja maior que 20 ou o volume é maior que 4000.

In [14]:
dicionario = {
       "nomes": ["Weg", "Petrobras", "Vale", "Petrobras", "Lojas Renner"],
       "tickers": ["WEGE3", "PETR3", "VALE3", "PETR4", "LREN3"],  
       "cotacoes": [20, 30, 40, 12, 35],
       "preco_sobre_lucro": [25, 6, 12, 7, 25],  
       "volume": [5000, 1000, 4000, 7000, 1200]
}

df_info_empresas = pd.DataFrame(dicionario)

df_info_empresas = df_info_empresas.set_index("tickers")

df_info_empresas

         cotacoes         nomes  preco_sobre_lucro  volume
tickers
WEGE3          20           Weg                 25    5000
PETR3          30     Petrobras                  6    1000
VALE3          40          Vale                 12    4000
PETR4          12     Petrobras                  7    7000
LREN3          35  Lojas Renner                 25    1200

In [15]:
#40
df_info_empresas.columns = ['preços','nomes','pl','volume']
df_info_empresas

         preços         nomes  pl  volume
tickers
WEGE3        20           Weg  25    5000
PETR3        30     Petrobras   6    1000
VALE3        40          Vale  12    4000
PETR4        12     Petrobras   7    7000
LREN3        35  Lojas Renner  25    1200

In [17]:
#41
df_info_empresas.columns

Index(['preços', 'nomes', 'pl', 'volume'], dtype='object')

In [32]:
#42
volume_e_pl = df_info_empresas.columns[[-1,-2]]

volume_e_pl

Index(['volume', 'pl'], dtype='object')

In [27]:
#43
petrobras = df_info_empresas[df_info_empresas['nomes'] == 'Petrobras']

petrobras

         preços      nomes  pl  volume
tickers
PETR3        30  Petrobras   6    1000
PETR4        12  Petrobras   7    7000

In [31]:
#44
empresas_pl_menor_10 = df_info_empresas[df_info_empresas['pl']<10]

empresas_pl_menor_10

         preços      nomes  pl  volume
tickers
PETR3        30  Petrobras   6    1000
PETR4        12  Petrobras   7    7000

In [36]:
#45
empresas_pl_maior_10_e_volume = df_info_empresas[df_info_empresas['pl']>10 & (df_info_empresas['volume']>2000)]

empresas_pl_maior_10_e_volume

         preços         nomes  pl  volume
tickers
WEGE3        20           Weg  25    5000
PETR3        30     Petrobras   6    1000
VALE3        40          Vale  12    4000
PETR4        12     Petrobras   7    7000
LREN3        35  Lojas Renner  25    1200

In [43]:
#46
empresas_cot_maior_30_e_volume_maior_2000 = df_info_empresas[df_info_empresas['preços']>30 & (df_info_empresas['volume']>2000)]

empresas_cot_maior_30_e_volume_maior_2000

         preços         nomes  pl  volume
tickers
WEGE3        20           Weg  25    5000
PETR3        30     Petrobras   6    1000
VALE3        40          Vale  12    4000
PETR4        12     Petrobras   7    7000
LREN3        35  Lojas Renner  25    1200

# Mundo 5

Agora que você aprendeu como manipular colunas, chegou a hora de aprender a selecionar dados dentro da tabela. Como pegar um dado específico, como o preço da Weg em algum dia específico?